<a href="https://colab.research.google.com/github/JayDock/My-journey-to-Machine-Learning/blob/main/Pandas_with_CSV_files.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('/content/drive/MyDrive/CSV /stocks.csv')
df.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3313 entries, 0 to 3312
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3313 non-null   object
 1   Open       3313 non-null   float64
 2   High       3313 non-null   float64
 3   Low        3313 non-null   float64
 4   Close      3313 non-null   float64
 5   Adj Close  3313 non-null   float64
 6   Volume     3313 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 181.3+ KB

In [6]:
df.describe()

              Open         High  ...    Adj Close        Volume
count  3313.000000  3313.000000  ...  3313.000000  3.313000e+03
mean    380.186092   383.493740  ...   380.072458  8.038476e+06
std     223.818650   224.974534  ...   223.853780  8.399521e+06
min      49.274517    50.541279  ...    49.681866  7.900000e+03
25%     226.556473   228.394516  ...   226.407440  2.584900e+06
50%     293.312286   295.433502  ...   293.029114  5.281300e+06
75%     536.650024   540.000000  ...   536.690002  1.065370e+07
max     992.000000   997.210022  ...   989.679993  8.276810e+07

[8 rows x 6 columns]

In [7]:
df['Open'].value_counts()

293.590485    4
261.558807    3
980.000000    3
780.000000    3
228.513733    3
             ..
801.000000    1
531.000000    1
266.288055    1
527.648132    1
640.000000    1
Name: Open, Length: 3208, dtype: int64

# **CSV**

In [8]:
from io import StringIO, BytesIO

In [35]:
data = ('Col1, col2, col3\n'
        'x, y, 1\n'
        'a, b, 2\n'
        'c, d, 3')

In [22]:
type(data)

str

In [36]:
pd.read_csv(StringIO(data))

  Col1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

# **To read specific columns**

In [43]:
df = pd.read_csv(StringIO(data), usecols = ['Col1'])
df

  Col1
0    x
1    a
2    c

# **To convet back to CSV**

In [45]:
df.to_csv('Test.csv')

# **Specifying columns data type**

In [58]:
data = ('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8,\n'
        '9,10,11')

In [59]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8,
9,10,11

In [60]:
df = pd.read_csv(StringIO(data), dtype = object)

ParserError: ignored

In [65]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [66]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [67]:
pd.read_csv(StringIO(data), index_col = 0)       #making index as 0 th columb

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [68]:
pd.read_csv(StringIO(data), index_col = 1)         #making index as 1 st column which is here a

        index    b     c
a
apple       4  bat   5.7
orange      8  cow  10.0

In [78]:
data = ('a,b,c\n'
           '4,apple,bat,\n'        #4 is a number so it is considered as an index
            '8,orange,cow,')       #8is a number so it is considered as an index

In [79]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [80]:
pd.read_csv(StringIO(data), index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [ ]:
data = ('a,b,c\n'
           '4,apple,bat,\n'        
            '8,orange,cow,')

In [81]:
pd.read_csv(StringIO(data), usecols = ['b','c'], index_col=False)

        b    c
0   apple  bat
1  orange  cow